In [3]:
import numpy as np
import pandas as pd

In [4]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [5]:
df = pd.DataFrame(people)

In [6]:
df.head()

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None

In [7]:
# isin()
df.loc[df['first'].isin(['Corey', 'Jane'])]

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55

In [8]:
# isnull() or notnull()
df.loc[df['last'].notnull()]

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
6     NA  Missing                       NA  Missing

In [9]:
df.rename_axis('Serial', axis='rows')

        first     last                    email      age
Serial
0       Corey  Schafer  CoreyMSchafer@gmail.com       33
1        Jane      Doe        JaneDoe@email.com       55
2        John      Doe        JohnDoe@email.com       63
3       Chris  Schafer                     None       36
4         NaN      NaN                      NaN     None
5        None      NaN      Anonymous@email.com     None
6          NA  Missing                       NA  Missing

In [ ]:
combined_products = pd.concat([gaming_products, movie_products])

In [ ]:
left = powerlifting_meets.set_index('MeetID')
right = powerlifting_competitors.set_index('MeetID')

powerlifting_combined = left.join(right)